[{
    "title": "Spacetime Physics",
    "content": "Our imagination is stretched to the utmost, not, as in fiction, to imagine things which are not really there, but just to comprehend those things which are there.\n\nRichard P. Feynman\n\nDisagree on northward and eastward separations and agree on distance\nDaytime surveyor uses magnetic north\n\nOnce upon a time there was a Daytime surveyor who measured off the king's lands. He took his directions of north and east from a magnetic compass needle. Eastward separations from the center of the town square he measured in meters. The northward direction was sacred. He measured northward separations from the town square in a different unit, in miles. His records were complete and accurate and were often consulted by other Daytimers.\n\nNighttime surveyor uses North-Star north\n\nA second group, the Nighttimers, used the services of another surveyor. Her north and east directions were based on a different standard of north: the direction of the North Star. She too measured separations eastward from the center of the town square in meters and sacred separations northward in miles. The records of the Nighttime surveyor were complete and accurate. Marked by a steel stake, every corner of a plot appeared in her book, along with its eastward and northward separations from the town square.\n\nDaytimers and Nighttimers did not mix but lived mostly in peace with one another. However, the two groups often disputed the location of property boundaries. Why? Because a given corner of the typical plot of land showed up with different numbers in the two record books for its eastward separation from the town center, measured in meters. Northward measurements in miles also did not agree between the two record books. The differences were small, but the most careful surveying did not succeed in eliminating them. No one knew what to do about this single source of friction between Daytimers and Nighttimers.\n\nOne fall a student of surveying turned up with novel open-mindedness. Unlike all previous students at the rival schools, he attended both. At Day School he learned from one expert his method of recording locations of gates of the town and corners of plots of land based on magnetic north. At Night School he learned the other method, based on North-Star north.\n\nStudent converts miles to meters\n\nIn defiance of tradition, the student took the daring and heretical step of converting northward measurements, previously expressed always in miles, into meters by multiplying with a constant conversion factor k = 1609.344 meters/mile. So, for example, a northward separation of 3 miles could be converted to k x 3 miles = 1609.344 meters/mile x 3 miles = 4828.032 meters. \"At last we are treating both directions the same!\" he exclaimed.\n\nDiscovery: Invariance of distance\n\nFlushed with success, the student methodically converted all northward measurements to units of meters. Then the student realized that the quantity he had calculated, the numerical value of the above expressions, was not only the same for Daytime and Nighttime measurements. It was also the square of a length: (meters)^2. He decided to give this length a name. He called it the distance from the center of town.\n\n(distance)^2 = (northward separation in meters)^2 + (eastward separation in meters)^2\n\nHe said he had discovered the principle of invariance of distance; he reckoned exactly the same value for distance from Daytime measurements as from Nighttime measurements, despite the fact that the two sets of surveyors' numbers differed significantly.\n\nAfter some initial confusion and resistance, Daytimers and Nighttimers welcomed the student's new idea. The invariance of distance, along with further results, made it possible to harmonize Daytime and Nighttime surveys, so everyone could agree on the location of each plot of land. In this way the last source of friction between Daytimers and Nighttimers was removed.\n",
    "tags": ["relativity"]
  }
]