[{
    "title": "Electric Field",
    "content": "E⃗ to represent the electric field. I am using the word “victim” for any particle upon which an electric field is exerting a force. The electric field will only exert a force on a particle if that particle has charge. So all “victims” of an electric field have charge. If there does happen to be a charged particle in an electric field, then that charged particle (the victim) will experience a force\n\nF⃗ =qE⃗ (B2.1)\n\nwhere q is the charge of the victim and E⃗ is the electric field vector at the location of the victim. We can think of the electric field as a characteristic of space. The force experienced by the victim charged particle is the product of a characteristic of the victim (its charge) and a characteristic of the point in space (the electric field) at which the victim happens to be.\n\nThe electric field is not matter. It is not “stuff.” It is not charge. It has no charge. It neither attracts nor repels charged particles. It cannot do that because its “victims,” the charged particles upon which the electric field exerts force, are within it. To say that the electric field attracts or repels a charged particle would be analogous to saying that the water in the ocean attracts or repels a submarine that is submerged in the ocean. Yes, the ocean water exerts an upward buoyant force on the submarine. But, it neither attracts nor repels the submarine. In like manner, the electric field never attracts nor repels any charged particles. It is nonsense to say that it does.\n\nIf you have two source charge particles, e.g., one at point A and another at point B, each creating its own electric field vector at one and the same point P, the actual electric field vector at point P is the vector sum of the two electric field vectors. If you have a multitude of charged particles contributing to the electric field at point P, the electric field at point P is the vector sum of all the electric field vectors at P. Thus, by means of a variety of source charge distributions, one can create a wide variety of electric field vector sets in some chosen region of space.\n\nThe electric field at any location is defined to be in the direction of the force that the electric field would exert on a positively charged victim if there was a positively charged victim at that location. The force exerted on a negatively charged particle by the electric field is always in the direction opposite that of the electric field itself.\n\nIn the context of the electric field as the set of all electric field vectors in a region of space, the simplest kind of an electric field is a uniform electric field. A uniform electric field is one in which every electric field vector has one and the same magnitude and one and the same direction.\n\nPhysicists have adopted a set of conventions for depicting electric fields. The result of the application of the conventions is known as an electric field diagram. According to the convention, the drawer creates a set of curves or lines, with arrowheads, such that, at every point on each curve, the electric field is directed tangent to the curve, in the direction agreeing with that depicted by the arrowhead on that curve. The closer the lines are, the stronger the electric field they represent. In the case of a uniform electric field, because the magnitude of the electric field is the same everywhere, the line spacing must be the same everywhere. Furthermore, because the electric field in this example has a single direction, namely eastward, the electric field lines will be straight lines, with arrowheads.",
    "tags": ["electric"]
  }]