[{
"title": "Circular Motion",
"content":"Circular motion\nUnderstanding\n➔ Period, frequency, angular displacement, and angular velocity\n➔ Centripetal force\n➔ Centripetal acceleration\n\nNature of science\nThe drive to develop ideas about circular motion came from observations of the universe.\nHow was it that astronomical objects could move in circular or elliptical orbits? What kept\nthem in place in their motion? Scientists were able to deduce that there must be a force acting\nradially inwards for every case of circular motion that is observed. Whether it is a bicycle going\naround a corner or a planet orbiting its star, the physics is the same.\n\nApplications and skills\n➔ Identifying the forces providing the centripetal forces such as tension, friction,\ngravity, electrical, or magnetic\n➔ Solving problems involving centripetal force, centripetal acceleration, period, frequency,\nangular displacement, linear speed, and angular velocity\n➔ Qualitatively and quantitatively describing examples of circular motion including\ncases of vertical and horizontal circular motion\n\nEquations\n➔ speed–angular speed relationship: v = ωr\n➔ centripetal acceleration: a = v² / r = 4π²r / T²\n➔ centripetal force: F = mv² / r = mω²r\n\nMoving in a circle\nMost children take great delight in an object on a string whirling in a circle – though they may\nbe less happy with the consequences when the string breaks! Rides at a theme park and trains\non a railway are yet more examples of movement in a circle. What is needed to keep something\nrotating at constant speed?\n\nIn circular motion we say that the speed is constant but not the velocity. Velocity, as a vector,\nhas both magnitude and direction. The object on the string has constant speed, but its direction\nis changing all the time. Whenever velocity changes (even if only the direction), the object is\naccelerated. Understanding this acceleration is key to understanding circular motion.\n\nAngular displacement\nThe angle moved around the circle from the starting point is called the angular displacement.\nIt is measured in radians or degrees, but radians are preferred in physics. One full revolution\nis 2π radians.\n\nAngular speed\nAngular speed (ω) is the rate of change of angular displacement:\nω = θ / t\n\nThe relationship between angular and linear speed is v = ωr.\n\nCentripetal acceleration\nAn object moving at constant speed in a circle is continuously changing direction, so it must be\naccelerating towards the center. The magnitude of this acceleration is:\na = v² / r = ω²r\n\nCentripetal force\nAccording to Newton’s second law, the force required to produce this acceleration is:\nF = ma = mv² / r = mω²r\n\nThis inward force may be provided by tension, friction, gravity, or another interaction depending\non the system. For example, tension provides the centripetal force for a whirling mass on a\nstring, while gravity provides it for a planet orbiting a star.\n",
"content": "Circular motion\nUnderstanding\n➔ Period, frequency, angular displacement, and angular velocity\n➔ Centripetal force\n➔ Centripetal acceleration\n\nNature of science\nThe drive to develop ideas about circular motion came from observations of the universe.\nHow was it that astronomical objects could move in circular or elliptical orbits? What kept\nthem in place in their motion? Scientists deduced that a force must act radially inwards for\nevery case of circular motion. Whether it is a bicycle going around a corner or a planet orbiting\nits star, the physics is the same.\n\nApplications and skills\n➔ Identifying the forces providing the centripetal force such as tension, friction, gravity,\nelectrical, or magnetic\n➔ Solving problems involving centripetal force, centripetal acceleration, period, frequency,\nangular displacement, linear speed, and angular velocity\n➔ Describing examples of circular motion including cases of vertical and horizontal motion\n\nEquations\n➔ Speed–angular speed relationship: v = ωr\n➔ Centripetal acceleration: a = v² / r = 4π²r / T²\n➔ Centripetal force: F = mv² / r = mω²r\n\nMoving in a circle\nMost children take delight in an object on a string whirling in a circle – though they may be\nless happy when it breaks! Rides at theme parks and trains on curved tracks are examples of\ncircular motion. What keeps them rotating at constant speed?\n\nIn circular motion, the speed is constant but the velocity is not. Velocity has both magnitude\nand direction; the direction changes continuously, meaning the object accelerates toward the\ncenter. This inward acceleration is called the centripetal acceleration.\n\nAngular displacement\nThe angle an object moves through around a circle from its starting point is its angular\ndisplacement. It is usually measured in radians. One full revolution equals 2π radians.\n\nAngular speed\nAngular speed (ω) is the rate of change of angular displacement:\nω = θ / t\n\nThe link between angular and linear speed is given by:\nv = ωr\n\nPeriod and frequency\nThe period (T) is the time for one complete revolution. The frequency (f) is the number of\nrevolutions per second. Their relationship is:\nT = 1 / f and ω = 2πf\n\nCentripetal acceleration\nAn object moving at constant speed in a circle is continuously changing direction, so it must be\naccelerating toward the center. The magnitude of the acceleration is:\na = v² / r = ω²r\n\nCentripetal force\nAccording to Newton’s second law, the inward force needed to produce this acceleration is:\nF = ma = mv² / r = mω²r\n\nThis centripetal force may be provided by tension, friction, gravity, or other forces depending\non the system. For instance, tension provides the force in a whirling mass on a string, while\ngravity provides it for a planet orbiting a star.\n\nNature of science\nCentripetal versus centrifugal\nIn everyday speech we hear of 'centrifugal force'—a fictitious outward force felt in a rotating\nframe of reference. Physically, the real force is centripetal, directed toward the center. The\nsensation of being flung outward arises because your body tends to move in a straight line\n(Newton’s first law) while the rotating frame changes direction.\n\nExamples and applications\n\nTurning on a horizontal road\nFor a car rounding a bend, the friction between the tires and the road provides the centripetal\nforce. The condition for no skidding is:\n(mv² / r) < μₛmg\nwhich gives the maximum safe speed:\nvₘₐₓ = √(μₛgr)\n\nBanking\nTracks and roads are often banked to reduce reliance on friction. For a banked turn at angle θ,\nthe horizontal component of the normal force provides the centripetal force:\nN sinθ = mv² / r\nand the vertical component balances weight:\nN cosθ = mg\nDividing gives:\ntanθ = v² / (gr)\nThus, at a given speed and radius, the required banking angle is independent of mass.\n\nVertical circular motion\nIf an object moves in a vertical circle, the tension in the string changes with position.\nAt the top of the circle:\nT_top + mg = mv² / r → T_top = mv² / r - mg\nAt the bottom of the circle:\nT_bottom - mg = mv² / r → T_bottom = mv² / r + mg\n\nThe tension is maximum at the bottom and minimum at the top. To keep the motion circular,\nthe string must stay taut, requiring a minimum speed at the top:\nv_top = √(gr)\n\nEnergy changes in a vertical circle\nNeglecting air resistance, mechanical energy is conserved. As the object rises, kinetic energy\nis converted into gravitational potential energy; as it descends, the reverse occurs. The speed\nis greatest at the bottom and least at the top.\n\nExample: car over a bridge\nA car passes over a convex bridge of radius r. The normal reaction between car and road\nprovides the 'tension' of the circular motion. The car just loses contact when the normal force\nis zero, so:\nmg = mv² / r → v = √(gr)\n\nAmusement rides\nIn rotating 'wall of death' rides, people are pressed against the wall as the floor drops away.\nThe normal reaction from the wall provides the centripetal force, and friction prevents them\nfrom sliding down. When frictional force equals weight, μN = mg, allowing calculation of the\nminimum rotation speed.\n\nWorked example\nA hammer thrower swings a 4.0 kg hammer on a 4.2 m chain 7.5 times in 5.2 seconds.\nFind the angular speed and tension in the chain.\n\nNumber of revolutions = 7.5 → angular displacement = 7.5 × 2π = 15π radians\nAngular speed = θ / t = 15π / 5.2 = 9.1 rad s⁻¹\nTension = m r ω² = 4.0 × 4.2 × (9.1)² = 1400 N\n\nIn reality, the thrower inclines the circle at about 45° to maximize range, so the actual tension\nis slightly higher because a component of the tension must balance the hammer’s weight.\n",
"tags": ["circular motion", "centripetal force", "angular velocity", "high school physics", "circular"],
"difficulty": ["international baccalaureate"]
}]