[{
"title": "Circular Motion",
"content":"Circular motion\nUnderstanding\n➔ Period, frequency, angular displacement, and angular velocity\n➔ Centripetal force\n➔ Centripetal acceleration\n\nNature of science\nThe drive to develop ideas about circular motion came from observations of the universe.\nHow was it that astronomical objects could move in circular or elliptical orbits? What kept\nthem in place in their motion? Scientists were able to deduce that there must be a force acting\nradially inwards for every case of circular motion that is observed. Whether it is a bicycle going\naround a corner or a planet orbiting its star, the physics is the same.\n\nApplications and skills\n➔ Identifying the forces providing the centripetal forces such as tension, friction,\ngravity, electrical, or magnetic\n➔ Solving problems involving centripetal force, centripetal acceleration, period, frequency,\nangular displacement, linear speed, and angular velocity\n➔ Qualitatively and quantitatively describing examples of circular motion including\ncases of vertical and horizontal circular motion\n\nEquations\n➔ speed–angular speed relationship: v = ωr\n➔ centripetal acceleration: a = v² / r = 4π²r / T²\n➔ centripetal force: F = mv² / r = mω²r\n\nMoving in a circle\nMost children take great delight in an object on a string whirling in a circle – though they may\nbe less happy with the consequences when the string breaks! Rides at a theme park and trains\non a railway are yet more examples of movement in a circle. What is needed to keep something\nrotating at constant speed?\n\nIn circular motion we say that the speed is constant but not the velocity. Velocity, as a vector,\nhas both magnitude and direction. The object on the string has constant speed, but its direction\nis changing all the time. Whenever velocity changes (even if only the direction), the object is\naccelerated. Understanding this acceleration is key to understanding circular motion.\n\nAngular displacement\nThe angle moved around the circle from the starting point is called the angular displacement.\nIt is measured in radians or degrees, but radians are preferred in physics. One full revolution\nis 2π radians.\n\nAngular speed\nAngular speed (ω) is the rate of change of angular displacement:\nω = θ / t\n\nThe relationship between angular and linear speed is v = ωr.\n\nCentripetal acceleration\nAn object moving at constant speed in a circle is continuously changing direction, so it must be\naccelerating towards the center. The magnitude of this acceleration is:\na = v² / r = ω²r\n\nCentripetal force\nAccording to Newton’s second law, the force required to produce this acceleration is:\nF = ma = mv² / r = mω²r\n\nThis inward force may be provided by tension, friction, gravity, or another interaction depending\non the system. For example, tension provides the centripetal force for a whirling mass on a\nstring, while gravity provides it for a planet orbiting a star.\n",
"tags": ["circular motion", "centripetal force", "angular velocity", "high school physics", "circular"],
"difficulty": ["International Baccalaureate"]
}]