[{
    "title": "Electric Field",
    "content": "E⃗ to represent the electric field. I am using the word “victim” for any particle upon which an electric field is exerting a force. The electric field will only exert a force on a particle if that particle has charge. So all “victims” of an electric field have charge. If there does happen to be a charged particle in an electric field, then that charged particle (the victim) will experience a force\n\nF⃗ =qE⃗ (B2.1)\n\nwhere q is the charge of the victim and E⃗ is the electric field vector at the location of the victim. We can think of the electric field as a characteristic of space. The force experienced by the victim charged particle is the product of a characteristic of the victim (its charge) and a characteristic of the point in space (the electric field) at which the victim happens to be.\n\nThe electric field is not matter. It is not “stuff.” It is not charge. It has no charge. It neither attracts nor repels charged particles. It cannot do that because its “victims,” the charged particles upon which the electric field exerts force, are within it. To say that the electric field attracts or repels a charged particle would be analogous to saying that the water in the ocean attracts or repels a submarine that is submerged in the ocean. Yes, the ocean water exerts an upward buoyant force on the submarine. But, it neither attracts nor repels the submarine. In like manner, the electric field never attracts nor repels any charged particles. It is nonsense to say that it does.\n\nIf you have two source charge particles, e.g., one at point A and another at point B, each creating its own electric field vector at one and the same point P, the actual electric field vector at point P is the vector sum of the two electric field vectors. If you have a multitude of charged particles contributing to the electric field at point P, the electric field at point P is the vector sum of all the electric field vectors at P. Thus, by means of a variety of source charge distributions, one can create a wide variety of electric field vector sets in some chosen region of space.\n\nThe electric field at any location is defined to be in the direction of the force that the electric field would exert on a positively charged victim if there was a positively charged victim at that location. The force exerted on a negatively charged particle by the electric field is always in the direction opposite that of the electric field itself.\n\nIn the context of the electric field as the set of all electric field vectors in a region of space, the simplest kind of an electric field is a uniform electric field. A uniform electric field is one in which every electric field vector has one and the same magnitude and one and the same direction.\n\nPhysicists have adopted a set of conventions for depicting electric fields. The result of the application of the conventions is known as an electric field diagram. According to the convention, the drawer creates a set of curves or lines, with arrowheads, such that, at every point on each curve, the electric field is directed tangent to the curve, in the direction agreeing with that depicted by the arrowhead on that curve. The closer the lines are, the stronger the electric field they represent. In the case of a uniform electric field, because the magnitude of the electric field is the same everywhere, the line spacing must be the same everywhere. Furthermore, because the electric field in this example has a single direction, namely eastward, the electric field lines will be straight lines, with arrowheads.",
  "tags": ["Basics of Electric Field"],
    "difficulty": ["easy" ]
  },  {
    "title": "Electromagnetic Induction",
    "content": "Inducing an emf\n\nIn Topic 5 we saw that when an electric charge moves in a magnetic field, then a force acts on the charge (and therefore on the conductor in which it is moving). In a reverse sense, a movement or change in a magnetic field relative to a stationary charge gives rise to an electric current. This phenomenon is called electromagnetic induction.\n\nInvestigate!\nMaking a current\n● Begin with a magnet and a coil or a solenoid of wire. Arrange the coil horizontally and connect it to a galvanometer (a form of sensitive ammeter, with the zero in the middle of the scale). You can use a laboratory coil, or you can wind your own from suitable metal wire using a cylinder as a former.\n● Move the bar magnet so that its north-seeking pole approaches one end of the coil and observe the effect on the meter. Record the direction of the current as indicated by the meter and the peak value shown.\n● Repeat the movement, moving the bar magnet with its south-seeking pole towards the coil.\n● Move the bar magnet away from the coil.\n● Change the speed with which you move the magnet.\n● Compare the current directions for each case and also the size of the current produced.\n● Now try moving the coil and keeping the magnet still. Does this change your observation?\n● Now try moving the coil and the magnet at the same speed and in the same direction. What is the size of the current now? If your coil allows it, you might also try making the magnet enter the coil at an angle rather than along its axis. You could also try moving the magnet completely through the coil and out of the other side. Try to interpret this complex situation when you have understood the simpler cases.\n● Relate the direction of current flow in the coil to the magnetic poles produced at the ends of the coil using the ideas in Topic 5. (Figure 1(b) reminds you of the rule.)\n\nThe results for this simple experiment are shown in figure 1(c). You should focus both on the direction of the conventional current flow and on the magnitude of the current. You are observing results similar to those made by Faraday in the 19th century.\n\nA number of conclusions emerge from these simple experiments:\n● The current only appears when there is relative motion between the coil and the magnet; either or both can move to produce the effect. However, if both coil and magnet move with no relative motion between them then no current occurs. Only movement of the wire in the coil relative to the field is important.\n● When the north-seeking pole of the magnet is inserted into the coil, the current in the coil tends to reduce the magnet’s motion by producing another north-seeking pole at the magnet end of the coil. Push a south-seeking pole in and another south pole appears at the magnet end of the coil. It is as though the system acts to repel the bar magnet and to reduce its movement. The system appears to oppose any change in the magnetic flux; the greater the rate of change, the greater is this opposition. We will look at this again later.\n● In the same way, when a magnetic pole is moved away from the coil, the opposite pole is formed by the current in the coil in an attempt to attract the magnet and reduce its speed of motion.\n● Moving the coil at greater speeds relative to the magnet increases the sizes of the currents. The effect is at a maximum when the axis of the magnet between its poles is perpendicular to the area of cross-section of the coil.\nThe keys to understanding these effects lie in what we said earlier in Topic 5 about the motion of charges in a magnetic field and what we know about the internal structure of the conducting wire that makes up the coil.\n\nFleming’s left-hand rule for induction effects: The direction of the induced current in a conductor moving through a magnetic field can be determined using Fleming’s left-hand rule. A force acts on the free electrons in the conductor, creating an induced emf.\n\nThe system is acting to move the electrons through the resistor, and because this is a transformation of energy into an electric form, the source of the energy is termed an electromotive force (emf). The induced emf arises from an induction effect, hence the term “induced emf.”\n\nElectromagnetic force: Perhaps you can now see why the term electromagnetic force arose in the early days of electromagnetic induction – and why it still persists. Some physicists object that no force acts when the term emf is applied to electric cells, batteries, piezoelectric devices, and so on – therefore, they say, emf is not a good expression. It is true that it is difficult to see how the word “force” can apply in the case of a cell. But in the case of electromagnetic induction, it is clear that a force is acting on the electrons in the conductor that is being moved and so the term emf continues to be used in physics. The fact that we often use the abbreviation emf rather than the full expression is a reminder that we should not focus on the term “force” but rather on the units of emf: J C-1.\n\nLenz’s law: An important aspect of electromagnetic induction is that the induced emf exists whether the charge flows in a complete circuit or not. In the case shown in figure 2(b) the circuit is incomplete. Electrons flow along the rod until an excess of them sets up an electric field which repels further electrons, stopping further flow. It is only when the circuit is complete that charge flows. An induced emf is always generated by the system and the induced current will exist only if there is a complete circuit.\n\nThe observations you made in the Investigate! can be interpreted by looking closely at the directions of current in the coil relative to the movement of field and coil. A rule that describes this was summed up by the German scientist Heinrich Lenz in 1833. He stated that the direction of the induced current is such as to oppose the change that created the current.\n\nIn fact, Lenz’s law is little more than the conservation of energy. Suppose that, rather than opposing the induced effect, the change were to enhance it. This would imply an attraction instead of a repulsion between magnet and coil; the magnet would be pulled into the coil, accelerating as it goes. This would increase the speed and lead to an even greater acceleration. The magnet would move faster and faster into the coil, gaining kinetic energy from nowhere. Conservation of energy tells us this cannot happen.\n\nApplications of electromagnetic induction: There are many applications of electromagnetic induction over and above the generation of electrical energy. They include electromagnetic braking, which is used in large commercial road vehicles; the use of an induction coil to generate the large pds required to provide the spark that ignites the petrol–air mixture in a car engine; and the generation of the signal in geophones and metal detectors. In each of these examples, a changing magnetic field leads to the generation of an emf and demonstrates the physics developed in this subtopic.",
  "tags": [ "Induction"],
    "difficulty":[ "international baccalaureate" ]
  },  {
    "title": "Power Generation and Transmission",
     "content": "Alternating current (ac) generators\n\nIn this IB course we focus on the ac generator because it is commonly used for the generation of energy. Such a generator consists of a coil with a large number of turns; the coil rotates relative to a magnetic field.\n\n11\n(a)\nG\nfixed coil\nN S\nmagnet\nturn table\n(b)\nflux\nlinkage rate of change of flux\nlinkage and induced emf\n(c)\nθ or time\ntime\nac generator\nN S\nslip rings\nV\n(d)\nbrush\nN S N S N S\nFigure 1 Basic ac generator.\n\nFor the moment we will imagine a fixed coil placed between the poles of a U-shaped magnet that stands at the centre of a rotating turntable (figure 1(a)). The turntable can turn at different angular speeds and the coil can have different numbers of turns and cross-sectional areas. The coil is connected to a galvanometer or to a data logger that registers the emf across the coil. When the magnetic flux in the coil is maximum, the emf induced (current) is minimum (0) and vice-versa. Changing the speed of the turntable changes the frequency of the emf as well as its amplitude. Increasing the number of turns or increasing the area of the coil will increase the amplitude of the emf but leave the frequency unchanged if the turntable speed does not change.\n\nMagnetic field lines cut the coil as the turntable rotates and an induced emf is generated. However the emf varies as the turntable rotates. Figure 1(b) shows how the flux linkage varies with θ, the angle between the normal to the coil and field lines. When θ is equal to 90°, the field lines lie in the plane of the coil and so the flux through the coil is zero (cos 90° = 0 in equation ϕ = BA cos θ). When θ is equal to 0° the field lines are at 90° to the plane of the coil and the flux through the coil is a maximum. When the turntable rotation speed is constant, this graph also shows how the flux varies with time. The graph is a sine curve.\n\nThe emf induced in the coil is equal to -(dϕ/dt), in other words the negative of the gradient of the flux-time graph. Figure 1(b) also shows how the induced emf varies with time; this graph can be obtained either by differentiation or by a consideration of the gradient of the flux-time graph. When the normal to the coil and the field lines are parallel (θ is 90°) then the emf is zero because the coil does not – instantaneously – cut the field lines at all.\n\nHowever, while some ac generators have a rotating magnetic field, others have fixed magnets and a rotating coil (Figure 1(c)). The principle is however the same. The direction of charge flow in the coils varies with the position of the coil. The use of a direction rule shows this.\n\nWhen the left-hand wire is moving upwards as shown in Figure 1(d), the conventional current direction in this wire is to the back of the coil. The right-hand wire is moving downwards at the same instant and the current in this wire is towards the front of the coil. Charge flows clockwise (looking from above) in the coil and out into the external circuit.\n\nHalf a cycle later the sides of the coil will have exchanged position. Charge is again flowing clockwise, but because the coil has rotated, the current (so far as the meter is concerned) is in the opposite direction. Figure 1(d) shows this too.\n\nIf there were wires permanently connecting the coil to the meter they would quickly become twisted. Energy needs to be extracted from the generator without this happening. Slip rings are used for this. The ends of the coil terminate in two rings of metal that rotate with the coil about the same axis. Two stationary brushes, connected to the external part of the circuit, press onto the rotating rings and charge flows out into the circuit through these connections (Figure 1(c)).\n\nThe essential requirements for an ac generator are therefore:\n\n• a rotating coil\n• a magnetic field\n• relative movement between the coil and the magnetic field\n• a suitable connection to the outside world.\n\nReal-life generators are more sophisticated than our simple models and an Internet search will allow you to see many different types of ac generator.\n\nFor real generators, there is another issue that arises because an induced current is generated in the coils. As we saw in Sub-topic 11.1, any moving conductor carrying an induced current in a magnetic field has two forces acting on it: the force that moves it, and an opposite force that arises because of the induced current. This also applies to the rotating current-carrying coil in the ac generator. Fleming’s left-hand rule and Lenz’s law show that this force opposes whatever is turning the coil.\n\nIf a generator coil is being rotated clockwise by an external agent, then the magnetic forces that arise from the induced current interacting with the magnetic field will exert a turning force anticlockwise on the coil. Some of the energy provided by the external agent turning the coil has to be used to overcome this anticlockwise magnetic effect. This reduces the induced current that can be made available to the external circuit.\n\nHowever, remember that with no opposition, no work is done and no energy will be transferred from the agent (doing the turning) to the coil (and its associated electrical circuit).\n\nThis is easily demonstrated using a bicycle dynamo (a device similar to our first rotating-magnet generator) (see figure 2). In this type of dynamo a permanent magnet is rotated in the gap inside a coil. When the lamp is switched off so that no induced current is produced, the dynamo is relatively easy to turn (remember, there will still be an induced emf across the terminals). When the dynamo supplies current and lights the lamp, more effort is required to rotate the dynamo at the same speed since an opposing magnetic force will act on the current (coil). This is Lenz’s law in action.\n\nNature of science\n\nModelling an ac generator\nAlthough the following derivation will not be required in the examination, it shows you how Faraday’s law can be used to model the behaviour of a simple ac generator.\n\nThe coil has an average length l and an average width of w with N turns (these dimensions are shown in figure 3(a)). The area of the coil A is therefore l × w.\n\nAt the instant when the normal to the plane of the coil is at an angle θ to the magnetic field, the flux linkage through the coil is N × Φ, which is N × BAcos θ. The coil spins at a constant angular speed ω In time t the angle swept is θ (= ωt). Therefore the flux linkage varies with t as NB cos ωt and a graph showing how flux linkage varies with time has a cosine shape with maximum and minimum values of NBA at t = 0 and –NBA when the coil is halfway through one cycle.\n\nThe value of the induced emf at any instant is equal to the (-) rate of change of the flux linkage (NΦ) and this is the the (-) gradient of the flux linkage–time graph. So the graph of induced emf is a (negative) sine curve with an equation of which has maximum and minimum values for the emf of ε0 = ±BANω.\n\nA supply in which the current and voltage vary as a sine wave is an alternating supply. Although ω is used for convenience in the mathematics of the emf induced in the generator, for everyday purposes we use the frequency. This has the same meaning as elsewhere in physics: the number of cycles that occur each second. A generator that rotates 50 times in one second has an alternating current output at a frequency of 50 Hz.",
"tags": ["Power Generation"],
  "difficulty": ["international baccalaureate"]
}] 