[
{
  "title": "Basics",
  "content": "Kinematics is the branch of classical mechanics that describes the motion of points, objects and systems of groups of objects, without reference to the causes of motion (i.e., forces ). The study of kinematics is often referred to as the “geometry of motion.”\n\nObjects are in motion all around us. Everything from a tennis match to a space-probe flyby of the planet Neptune involves motion. When you are resting, your heart moves blood through your veins. Even in inanimate objects there is continuous motion in the vibrations of atoms and molecules. Interesting questions about motion can arise: how long will it take for a space probe to travel to Mars? Where will a football land if thrown at a certain angle? An understanding of motion, however, is also key to understanding other concepts in physics. An understanding of acceleration, for example, is crucial to the study of force.\n\nTo describe motion, kinematics studies the trajectories of points, lines and other geometric objects, as well as their differential properties (such as velocity and acceleration). Kinematics is used in astrophysics to describe the motion of celestial bodies and systems; and in mechanical engineering, robotics and biomechanics to describe the motion of systems composed of joined parts (such as an engine, a robotic arm, or the skeleton of the human body).\n\nA formal study of physics begins with kinematics. The word “kinematics” comes from a Greek word “kinesis” meaning motion, and is related to other English words such as “cinema” (movies) and “kinesiology” (the study of human motion). Kinematic analysis is the process of measuring the kinematic quantities used to describe motion. The study of kinematics can be abstracted into purely mathematical expressions, which can be used to calculate various aspects of motion such as velocity, acceleration, displacement, time, and trajectory.\n\nReference Frames and Displacement\nIn order to describe an object’s motion, you need to specify its position relative to a convenient reference frame.\n\nLearning objectives:\n- Evaluate displacement within a frame of reference.\n\nIn order to describe the motion of an object, you must first describe its position — where it is at any particular time. More precisely, you need to specify its position relative to a convenient reference frame. Earth is often used as a reference frame, and we often describe the position of objects related to its position to or from Earth. Mathematically, the position of an object is generally represented by the variable x.\n\nFrames of Reference\nThere are two choices you have to make in order to define a position variable x. You have to decide where to put x = 0 and which direction will be positive. This is referred to as choosing a coordinate system, or choosing a frame of reference. As long as you are consistent, any frame is equally valid. But you don’t want to change coordinate systems in the middle of a calculation. Imagine sitting in a train in a station when suddenly you notice that the station is moving backward. Most people would say that they just failed to notice that the train was moving — it only seemed like the station was moving. But this shows that there is a third arbitrary choice that goes into choosing a coordinate system: valid frames of reference can differ from each other by moving relative to one another. It might seem strange to use a coordinate system moving relative to the earth — but, for instance, the frame of reference moving along with a train might be far more convenient for describing things happening inside the train. Frames of reference are particularly important when describing an object’s displacement.\n\nDisplacement\nDisplacement is the change in position of an object relative to its reference frame. For example, if a car moves from a house to a grocery store, its displacement is the relative distance of the grocery store to the reference frame, or the house. The word “displacement” implies that an object has moved or has been displaced. Displacement is the change in position of an object and can be represented mathematically as follows:\n\nΔx = xf − x0\n\nwhere Δx is displacement, xf is the final position, and x0 is the initial position.\n\nIntroduction to Scalars and Vectors\nA vector is any quantity that has both magnitude and direction, whereas a scalar has only magnitude.\n\nLearning objectives:\n- Distinguish the difference between scalars and vectors\n\nWhat is the difference between distance and displacement? Whereas displacement is defined by both direction and magnitude, distance is defined by magnitude alone. Displacement is an example of a vector quantity. Distance is an example of a scalar quantity. A vector is any quantity with both magnitude and direction. Other examples of vectors include a velocity of 90 km/h east and a force of 500 newtons straight down.\n\nIn mathematics, physics, and engineering, a vector is a geometric object that has a magnitude (or length) and direction and can be added to other vectors according to vector algebra. The direction of a vector in one-dimensional motion is given simply by a plus (+) or minus (−) sign. A vector is frequently represented by a line segment with a definite direction, or graphically as an arrow, connecting an initial point A with a terminal point B.\n\nSome physical quantities, like distance, either have no direction or no specified direction. In physics, a scalar is a simple physical quantity that is not changed by coordinate system rotations or translations. It is any quantity that can be expressed by a single number and has a magnitude, but no direction. For example, a 20ºC temperature, the 250 kilocalories (250 Calories) of energy in a candy bar, a 90 km/h speed limit, a person’s 1.8 m height, and a distance of 2.0 m are all scalars. Note, however, that a scalar can be negative, such as a −20ºC temperature. In this case, the minus sign indicates a point on a scale rather than a direction. Scalars are never represented by arrows.\n\nKey Points:\n- To describe motion, kinematics studies the trajectories of points, lines and other geometric objects.\n- The study of kinematics can be abstracted into purely mathematical expressions.\n- Kinematic equations can be used to calculate various aspects of motion such as velocity, acceleration, displacement, and time.\n- Choosing a frame of reference requires deciding where the object’s initial position is and which direction will be considered positive.\n- Valid frames of reference can differ from each other by moving relative to one another.\n- Frames of reference are particularly important when describing an object’s displacement.\n- Displacement is the change in position of an object relative to its reference frame.\n- A vector is any quantity that has magnitude and direction.\n- A scalar is any quantity that has magnitude but no direction.\n- Displacement and velocity are vectors, whereas distance and speed are scalars.\n\nKey Terms:\n- kinematics: The branch of mechanics concerned with objects in motion, but not with the forces involved.\n- displacement: A vector quantity that denotes distance with a directional component.\n- frame of reference: A coordinate system or set of axes within which to measure the position, orientation, and other properties of objects in it.\n- scalar: A quantity that has magnitude but not direction; compare vector.\n- vector: A directed quantity, one with both magnitude and direction; the between two points.",
  "tags": ["One Dimensional Kinematics"],
  "difficulty": ["University Introductory / Advanced Placement C"]
},
{
  "title":"Speed and Velocity",
  "content": "Speed is a scalar quantity and has only magnitude. Velocity, on the other hand, is a vector quantity and so has both magnitude and direction. This distinction becomes more apparent when we calculate average speed and velocity.\n\nAverage speed is calculated as the distance traveled over the total time of travel. In contrast, average velocity is defined as the change in position (or displacement) over the total time of travel.\n\nThe SI unit for velocity is meters per second, or m/s, but many other units (such as km/h, mph, and cm/s) are commonly used. Suppose, for example, an airplane passenger took five seconds to move -4 m (the negative sign indicates that displacement is toward the back of the plane). His average velocity would be:\n\nv = Δx / t = -4 m / 5 s = -0.8 m/s\n\nThe minus sign indicates that the average velocity is also toward the rear of the plane.\n\nThe average velocity of an object does not tell us anything about what happens to it between the starting point and ending point, however. For example, we cannot tell from average velocity whether the airplane passenger stops momentarily or backs up before he gets to the back of the plane. To get more details, we must consider smaller segments of the trip over smaller time intervals.\n\nTo illustrate the difference between average speed and average velocity, consider the following additional example. Imagine you are walking in a small rectangle. You walk three meters north, four meters east, three meters south, and another four meters west. The entire walk takes you 30 seconds. If you are calculating average speed, you would calculate the entire distance (3 + 4 + 3 + 4 = 14 meters) over the total time, 30 seconds. From this, you would get an average speed of 14 / 30 = 0.47 m/s. When calculating average velocity, however, you are looking at the displacement over time. Because you walked in a full rectangle and ended up exactly where you started, your displacement is 0 meters. Therefore, your average velocity, or displacement over time, would be 0 m/s.\n\nInstantaneous Velocity: A Graphical Interpretation\n\nInstantaneous velocity is the velocity of an object at a single point in time and space as calculated by the slope of the tangent line.\n\nLearning objectives:\n- Differentiate instantaneous velocity from other ways of determining velocity\n\nTypically, motion is not with constant velocity nor speed. While driving in a car, for example, we continuously speed up and slow down. A graphical representation of our motion in terms of distance vs. time, therefore, would be more variable or “curvy” rather than a straight line, indicating motion with a constant velocity. (We limit our discussion to one-dimensional motion. It should be straightforward to generalize to three-dimensional cases.)\n\nTo calculate the speed of an object from a graph representing constant velocity, all that is needed is to find the slope of the line; this would indicate the change in distance over the change in time. However, for changing velocity it is not as straightforward.\n\nSince our velocity is constantly changing, we can estimate velocity in different ways. One way is to look at our instantaneous velocity, represented by one point on our curvy line of motion graphed with distance vs. time. In order to determine our velocity at any given moment, we must determine the slope at that point. To do this, we find a line that represents our velocity in that moment — shown graphically as the tangent line to the curve at that point. If we extend this line, we can easily calculate the displacement of distance over time and determine our velocity at that given point. The velocity of an object at any given moment is the slope of the tangent line through the relevant point on its x vs. t graph.\n\nIn calculus, finding the slope of a curve f(x) at x = x₀ is equivalent to finding the first derivative:\n\ndf(x)/dx | x = x₀\n\nOne interpretation of this definition is that the velocity shows how many meters the object would travel in one second if it continues moving at the same speed for at least one second.\n\nKey Points:\n- Average velocity can be calculated by determining the total displacement divided by the total time of travel.\n- The average velocity of an object does not tell us anything about what happens to it between the starting point and ending point.\n- Average velocity is different from average speed in that it considers the direction of travel and the overall change in position.\n- When velocity is constantly changing, we can estimate our velocity by looking at instantaneous velocity.\n- Instantaneous velocity is calculated by determining the slope of the line tangent to the curve at the point of interest.\n- Instantaneous velocity is similar to determining how many meters the object would travel in one second at a specific moment.\n\nKey Terms:\n- velocity: A vector quantity that denotes the rate of change of position with respect to time, or a speed with a directional component.\n- instantaneous: (As in velocity)—occurring, arising, or functioning without any delay; happening within an imperceptibly brief period of time.",
  "tags":["One Dimensional Kinematics"],
  "difficulty": ["University Introductory / Advanced Placement C"]
},
{
"title": "Acceleration",
  "content": "In physics, acceleration is the rate at which the velocity of a body changes with time. It is a vector quantity with both magnitude and direction. Acceleration is accompanied by a force, as described by Newton’s Second Law; the force, as a vector, is the product of the mass of the object being accelerated and the acceleration (vector), or F = ma. The SI unit of acceleration is the meter per second squared: m/s².\n\nAcceleration is a vector that points in the same direction as the change in velocity, though it may not always be in the direction of motion. For example, when an object slows down, or decelerates, its acceleration is in the opposite direction of its motion.\n\nThe motion of an object can be depicted graphically by plotting the position of an object over time. This distance-time graph can be used to create another graph that shows changes in velocity over time. Because acceleration is velocity in m/s divided by time in s, we can further derive a graph of acceleration from a graph of an object’s speed or position.\n\nPosition vs Time Graph: Notice that the object’s position changes slowly at the beginning of the journey, then more and more quickly as it picks up speed. Its position then changes more slowly as it slows down at the end of the journey. In the middle of the journey, while the velocity remains constant, the position changes at a constant rate.\n\nThis shows the velocity of the object over time. The object’s velocity increases in the beginning as it accelerates, then remains constant in the middle before it slows down toward the end. Notice that this graph is a representation of the slope of the previous position vs time graph. From this graph, we can further derive an acceleration vs time graph.\n\nVelocity vs Time: The object’s velocity increases as it accelerates at the beginning of the journey. It remains the same in the middle of the journey (where there is no acceleration). It decreases as the object decelerates at the end of the journey.\n\nTo do this, we would also plot the slope of the velocity vs time graph. In this graph, the acceleration is constant in the three different stages of motion. As we noted earlier, the object is increasing speed and changing positions slowly in the beginning. The acceleration graph shows that the object was increasing at a positive constant acceleration during this time. In the middle, when the object was changing position at a constant velocity, the acceleration was 0. This is because the object is no longer changing its velocity and is moving at a constant rate. Towards the end of the motion, the object slows down. This is depicted as a negative value on the acceleration graph. Note that in this example, the motion of the object is still forward (positive), but since it is decelerating, the acceleration is negative.\n\nAcceleration vs Time Graph: The object has positive acceleration as it speeds up at the beginning of the journey. It has no acceleration as it travels at constant velocity in the middle of the journey. Its acceleration is negative as it slows down at the end of the journey.\n\nMotion with Constant Acceleration\nConstant acceleration occurs when an object’s velocity changes by an equal amount in every equal time period.\n\nLearning objectives:\n- Describe how constant acceleration affects the motion of an object.\n\nOne-Dimensional Motion: When you drop an object, it falls vertically toward the center of the earth due to the constant acceleration of gravity.\n\nAn object experiencing constant acceleration has a velocity that increases or decreases by an equal amount for any constant period of time. Acceleration can be derived easily from basic kinematic principles. It is defined as the first time derivative of velocity (so the second derivative of position with respect to time):\n\na = ∂v / ∂t = ∂²x / ∂t²\n\nAssuming acceleration to be constant does not seriously limit the situations we can study and does not degrade the accuracy of our treatment, because in a great number of situations, acceleration is constant. When it is not, we can either consider it in separate parts of constant acceleration or use an average acceleration over a period of time.\n\nThe motion of falling objects is a simple, one-dimensional type of projectile motion in which there is no horizontal movement. For example, if you held a rock out and dropped it, the rock would fall only vertically downward toward the earth. If you were to throw the rock instead of just dropping it, it would follow a more projectile-like pattern, similar to the one a kicked ball follows.\n\nProjectile motion is the motion of an object thrown or projected into the air and is subject only to the acceleration of gravity. The object thrown is called a projectile, and the object’s path is called its trajectory. In two-dimensional projectile motion, there is both a vertical and a horizontal component.\n\nDue to the algebraic properties of constant acceleration, there are kinematic equations that relate displacement, initial velocity, final velocity, acceleration, and time. A summary of these equations is given below:\n\nx = x₀ + v̄t  \nv = v₀ + at  \nx = x₀ + v₀t + (1/2)at²  \nv² = v₀² + 2a(x − x₀)\n\nKey Points:\n- Acceleration is the rate at which the velocity of a body changes with time.\n- Acceleration is a vector that points in the same direction as the change in velocity, though it may not always be in the direction of motion.\n- Because acceleration is velocity in m/s divided by time in s, we can derive a graph of acceleration from a graph of an object’s speed or position.\n- Assuming acceleration to be constant does not seriously limit the situations we can study and does not degrade the accuracy of our treatment.\n- Due to the algebraic properties of constant acceleration, there are kinematic equations that can be used to calculate displacement, velocity, acceleration, and time.\n- Calculations with constant acceleration can be done in relation to one-dimensional motion as well as two-dimensional motion.\n\nKey Terms:\n- acceleration: The amount by which a speed or velocity increases (and so a scalar quantity or a vector quantity).\n- velocity: A vector quantity that denotes the rate of change of position with respect to time, or a speed with a directional component.\n- position: A place or location.\n- kinematic: Of or relating to motion or kinematics.",
  "tags": ["One Dimensional Kinematics"],
  "difficulty": ["University Introductory / Advanced Placement C"]
},
{
  "title": "Free Falling Objects",
  "content": "The motion of falling objects is the simplest and most common example of motion with changing velocity. If a coin and a piece of paper are simultaneously dropped side by side, the paper takes much longer to hit the ground. However, if you crumple the paper into a compact ball and drop the items again, it will look like both the coin and the paper hit the floor simultaneously. This is because the amount of force acting on an object is a function of not only its mass, but also area. Free fall is the motion of a body where its weight is the only force acting on an object.\n\nImage\n\nFree Fall: This clip shows an object in free fall.\n\nGalileo also observed this phenomena and realized that it disagreed with the Aristotle principle that heavier items fall more quickly. Galileo then hypothesized that there is an upward force exerted by air in addition to the downward force of gravity. If air resistance and friction are negligible, then in a given location (because gravity changes with location), all objects fall toward the center of Earth with the same constant acceleration, independent of their mass. That constant acceleration is gravity. Air resistance opposes the motion of an object through the air, while friction opposes motion between objects and the medium through which they are traveling. The acceleration of free-falling objects is referred to as the acceleration due to gravity, g. As we said earlier, gravity varies depending on location and altitude on Earth (or any other planet), but the average acceleration due to gravity on Earth is 9.8 m/s². This value is also often expressed as a negative acceleration in mathematical calculations due to the downward direction of gravity.\n\nThe best way to see the basic features of motion involving gravity is to start by considering straight up and down motion with no air resistance or friction. This means that if the object is dropped, we know the initial velocity is zero. Once the object is in motion, the object is in free-fall. Under these circumstances, the motion is one-dimensional and has constant acceleration, g. The kinematic equations for objects experiencing free fall are:\n\nv = v₀ - gt\ny = y₀ + v₀t - ½gt²\nv² = v₀² - 2g(y - y₀)\n\nwhere v = velocity, g = gravity, t = time, and y = vertical displacement.\n\nVideo 2.5.1: Free Fall Motion - Describes how to calculate the time for an object to fall if given the height and the height that an object fell if given the time to fall.\n\nExample 2.5.1:\n\nSome examples of objects that are in free fall include:\n- A spacecraft in continuous orbit. The free fall would end once the propulsion devices turned on.\n- A stone dropped down an empty well.\n- An object, in projectile motion, on its descent.\n\nKey Points:\n- The acceleration of free-falling objects is called the acceleration due to gravity, since objects are pulled towards the center of the Earth.\n- The acceleration due to gravity is constant on the surface of the Earth and has the value of 9.80 m/s².",
  "tags": ["One Dimensional Kinematics"],
  "difficulty": ["University Introductory / Advanced Placement C"]
},
{
  "title": "Motion in Two Dimensions",
   "content": "Motion with constant velocity is one of the simplest forms of motion. This type of motion occurs when an object is moving (or sliding) in the presence of little or negligible friction, similar to that of a hockey puck sliding across the ice. To have a constant velocity, an object must have a constant speed in a constant direction. Constant direction constrains the object to motion on a straight path.\n\nNewton’s second law (F = ma) suggests that when a force is applied to an object, the object would experience acceleration. If the acceleration is 0, the object shouldn’t have any external forces applied on it. Mathematically, this can be shown as the following:\n\na = dv/dt = 0 ⇒ v = const.\n\nIf an object is moving at constant velocity, the graph of distance vs. time (x vs. t) shows the same change in position over each interval of time. Therefore the motion of an object at constant velocity is represented by a straight line: x = x₀ + vt, where x₀ is the displacement when t = 0 (or at the y-axis intercept).\n\nImage\n\nMotion with Constant Velocity: When an object is moving with constant velocity, it does not change direction nor speed and therefore is represented as a straight line when graphed as distance over time.\n\nYou can also obtain an object’s velocity if you know its trace over time. Given a graph, we can calculate the velocity from the change in distance over the change in time. In graphical terms, the velocity can be interpreted as the slope of the line. The velocity can be positive or negative, and is indicated by the sign of our slope. This tells us in which direction the object moves.\n\nConstant Acceleration:\nAnalyzing two-dimensional projectile motion is done by breaking it into two motions: along the horizontal and vertical axes.\n\nLearning Objectives:\n- Analyze a two-dimensional projectile motion along horizontal and vertical axes\n\nProjectile motion is the motion of an object thrown, or projected, into the air, subject only to the force of gravity. The object is called a projectile, and its path is called its trajectory. The motion of falling objects is a simple one-dimensional type of projectile motion in which there is no horizontal movement. In two-dimensional projectile motion, such as that of a football or other thrown object, there is both a vertical and a horizontal component to the motion.\n\nImage\n\nProjectile Motion: Throwing a rock or kicking a ball generally produces a projectile pattern of motion that has both a vertical and a horizontal component.\n\nThe most important fact to remember is that motion along perpendicular axes is independent and thus can be analyzed separately. The key to analyzing two-dimensional projectile motion is to break it into two motions, one along the horizontal axis and the other along the vertical. To describe motion we must deal with velocity and acceleration, as well as with displacement.\n\nWe will assume all forces except for gravity (such as air resistance and friction, for example) are negligible. The components of acceleration are then very simple: aᵧ = -g = -9.81 m/s² (we assume that the motion occurs at small enough heights near the surface of the Earth so that the acceleration due to gravity is constant). Because the acceleration due to gravity is along the vertical direction only, aₓ = 0. Thus, the kinematic equations describing the motion along the x and y directions respectively, can be used:\n\nx = x₀ + vₓt\ny = y₀ + v₀yt + ½aᵧt²\nvᵧ = v₀y + aᵧt\nvᵧ² = v₀y² + 2aᵧ(y - y₀)\n\nWe analyze two-dimensional projectile motion by breaking it into two independent one-dimensional motions along the vertical and horizontal axes. The horizontal motion is simple, because aₓ = 0 and vₓ is thus constant. The velocity in the vertical direction begins to decrease as an object rises; at its highest point, the vertical velocity is zero. As an object falls toward the Earth again, the vertical velocity increases again in magnitude but points in the opposite direction to the initial vertical velocity. The x and y motions can be recombined to give the total velocity at any given point on the trajectory.\n\nKey Points:\n- Constant velocity means that the object in motion is moving in a straight line at a constant speed.\n- This line can be represented algebraically as: x = x₀ + vt, where x₀ represents the position of the object at t = 0, and the slope of the line indicates the object’s speed.\n- The velocity can be positive or negative, and is indicated by the sign of our slope. This tells us in which direction the object moves.\n- Constant acceleration in motion in two dimensions generally follows a projectile pattern.\n- Projectile motion is the motion of an object thrown or projected into the air, subject to only the (vertical) acceleration due to gravity.\n- We analyze two-dimensional projectile motion by breaking it into two independent one-dimensional motions along the vertical and horizontal axes.\n\nKey Terms:\n- constant velocity: Motion that does not change in speed nor direction.\n- kinematic: of or relating to motion or kinematics.",
  "tags": ["Two Dimensional Kinematics"],
  "difficulty": ["University Introductory / Advanced Placement C"]
},
{
  "title": "Vectors",
  "content": " Vectors are geometric representations of magnitude and direction which are often represented by straight arrows, starting at one point on a coordinate axis and ending at a different point. All vectors have a length, called the magnitude, which represents some quality of interest so that the vector may be compared to another vector. Vectors, being arrows, also have a direction. This differentiates them from scalars, which are mere numbers without a direction.\n\nA vector is defined by its magnitude and its orientation with respect to a set of coordinates. It is often useful in analyzing vectors to break them into their component parts. For two-dimensional vectors, these components are horizontal and vertical. For three dimensional vectors, the magnitude component is the same, but the direction component is expressed in terms of x, y, and z.\n\nDecomposing a Vector:\nTo visualize the process of decomposing a vector into its components, begin by drawing the vector from the origin of a set of coordinates. Next, draw a straight line from the origin along the x-axis until the line is even with the tip of the original vector. This is the horizontal component of the vector. To find the vertical component, draw a line straight up from the end of the horizontal vector until you reach the tip of the original vector. You should find you have a right triangle such that the original vector is the hypotenuse.\n\nDecomposing a vector into horizontal and vertical components is a very useful technique in understanding physics problems. Whenever you see motion at an angle, you should think of it as moving horizontally and vertically at the same time. Simplifying vectors in this way can speed calculations and help to keep track of the motion of objects.\n\nScalars and Vectors: Mr. Andersen explains the differences between scalar and vector quantities. He also uses a demonstration to show the importance of vectors and vector addition.\n\nImage:\nComponents of a Vector: The original vector, defined relative to a set of axes. The horizontal component stretches from the start of the vector to its furthest x-coordinate. The vertical component stretches from the x-axis to the most vertical point on the vector. Together, the two components and the vector form a right triangle.\n\nScalars vs. Vectors:\nScalars are physical quantities represented by a single number, and vectors are represented by both a number and a direction.\n\nLearning Objectives:\n- Distinguish the difference between the quantities scalars and vectors represent\n\nPhysical quantities can usually be placed into two categories, vectors and scalars. These two categories are typified by what information they require. Vectors require two pieces of information: the magnitude and direction. In contrast, scalars require only the magnitude. Scalars can be thought of as numbers, whereas vectors must be thought of more like arrows pointing in a specific direction.\n\nImage:\nA Vector: An example of a vector. Vectors are usually represented by arrows with their length representing the magnitude and their direction represented by the direction the arrow points.\n\nVectors require both a magnitude and a direction. The magnitude of a vector is a number for comparing one vector to another. The greater the magnitude, the longer the arrow. Physical concepts such as displacement, velocity, and acceleration are all examples of quantities that can be represented by vectors. Each of these quantities has both a magnitude (how far or how fast) and a direction.\n\nScalars differ from vectors in that they do not have a direction. Scalars are used primarily to represent physical quantities for which a direction does not make sense, such as mass, height, length, volume, and area.\n\nAdding and Subtracting Vectors Graphically:\nVectors may be added or subtracted graphically by laying them end to end on a set of axes.\n\nLearning Objectives:\n- Distinguish the difference between the quantities scalars and vectors represent\n\nAdding and Subtracting Vectors:\nVectors can be added graphically using the head-to-tail method. Start by drawing the first vector with its tail at the origin. Then draw the next vector so that its tail starts at the head of the previous vector. Continue this process until all vectors are placed. Draw a final vector from the origin to the head of the last vector; this is the resultant vector.\n\nImage:\nGraphical Addition of Vectors: Demonstrates the head-to-tail method.\n\nTo subtract vectors, draw the first vector. Then flip the vector to be subtracted (reverse its direction) and add it head-to-tail.\n\nAdding and Subtracting Vectors Using Components:\nIt is often simpler to add or subtract vectors using components.\n\nLearning Objectives:\n- Demonstrate how to add and subtract vectors by components\n\nTo use components, express each vector in terms of its horizontal and vertical parts, then add or subtract those components directly. This gives a resultant vector which can be drawn the same way as before.\n\nImage:\nVector with Horizontal and Vertical Components.\n\nMultiplying Vectors by a Scalar:\nMultiplying a vector by a scalar changes its magnitude but not its direction.\n\nLearning Objectives:\n- Summarize the interaction between vectors and scalars\n\nTo multiply a vector by a scalar, multiply the vector’s magnitude by the scalar. The result is a new vector in the same direction, with a scaled magnitude.\n\nExample:\nMultiplying a vector by 0.5 halves its length. Multiplying it by 3 triples its length. For example, doubling an object’s mass doubles the gravitational force vector acting on it.\n\nUnit Vectors and Scalar Multiplication:\nA unit vector has a magnitude of 1. Unit vectors define direction. For example, in Cartesian coordinates, x̂ and ŷ represent directions along the x and y axes.\n\nPosition, Displacement, Velocity, and Acceleration as Vectors:\nThese quantities are represented as vectors since they have both magnitude and direction.\n\nLearning Objectives:\n- Examine the applications of vectors in analyzing physical quantities\n\nDisplacement is the distance from a reference point in a specific direction. It is represented by a position vector. Velocity is the rate of change of displacement and has direction. Acceleration is the rate of change of velocity and is also directional.\n\nImage:\nVector Diagram: A person walking uphill is affected by gravity (downward vector) while moving at an angle (displacement vector).\n\nKey Points:\n- Vectors consist of magnitude and direction\n- Vectors can be broken into components using right triangles\n- Scalars have only magnitude\n- Examples of vectors: displacement, velocity, acceleration\n- Examples of scalars: mass, height, volume\n- Vectors can be added graphically or by components\n- To subtract vectors, add the inverse (negative direction)\n- Multiplying a vector by a scalar changes its length but not direction\n- Unit vectors have magnitude 1 and define direction\n\nKey Terms:\n- coordinates: Numbers indicating position relative to an axis\n- axis: A reference line for position or symmetry\n- magnitude: The length or size of a vector\n- origin: The zero point on a coordinate axis\n- component: A part of a vector (horizontal or vertical)\n- vector: A quantity with both magnitude and direction\n- scalar: A quantity with only magnitude\n- unit vector: A vector with magnitude 1\n- velocity: The rate of change of displacement\n- displacement: The change in position from a reference point\n- acceleration: The rate of change of velocity",
  "tags": ["Two Dimensional Kinematics"],
  "difficulty": ["University Introductory / Advanced Placement C"]
},
{
  "title":"Projectile Motion",
  "content": "Basic Equations and Parabolic Path\nProjectile motion is a form of motion where an object moves in parabolic path; the path that the object follows is called its trajectory.\n\nlearning objectives\n\nAssess the effect of angle and velocity on the trajectory of the projectile; derive maximum height using displacement\nProjectile Motion\nProjectile motion is a form of motion where an object moves in a bilaterally symmetrical, parabolic path. The path that the object follows is called its trajectory. Projectile motion only occurs when there is one force applied at the beginning on the trajectory, after which the only interference is from gravity. In a previous atom we discussed what the various components of an object in projectile motion are. In this atom we will discuss the basic equations that go along with them in the special case in which the projectile initial positions are null (i.e. x0=0 and y0=0).\n\nInitial Velocity\nThe initial velocity can be expressed as x components and y components:\n\nux = u*cosθ\nuy = u*sinθ\n\nIn this equation, u stands for initial velocity magnitude and θ refers to projectile angle.\n\nTime of Flight\nThe time of flight of a projectile motion is the time from when the object is projected to the time it reaches the surface. As we discussed previously, T depends on the initial velocity magnitude and the angle of the projectile:\n\nT = 2*uy/g = 2*u*sinθ/g\n\nAcceleration\nIn projectile motion, there is no acceleration in the horizontal direction. The acceleration, a, in the vertical direction is just due to gravity, also known as free fall:\n\nax = 0\nay = -g\n\nVelocity\nThe horizontal velocity remains constant, but the vertical velocity varies linearly, because the acceleration is constant. At any time, t, the velocity is:\n\nux = u*cosθ\nuy = u*sinθ - g*t\n\nYou can also use the Pythagorean Theorem to find velocity:\n\nu = sqrt(ux^2 + uy^2)\n\nDisplacement\nAt time, t, the displacement components are:\n\nx = u*t*cosθ\ny = u*t*sinθ - 1/2*g*t^2\n\nThe equation for the magnitude of the displacement is Δr = sqrt(x^2 + y^2).\n\nParabolic Trajectory\nWe can use the displacement equations in the x and y direction to obtain an equation for the parabolic form of a projectile motion:\n\ny = tanθ*x - (g/(2*u^2*cos^2θ))*x^2\n\nMaximum Height\nThe maximum height is reached when vy=0. Using this we can rearrange the velocity equation to find the time it will take for the object to reach maximum height:\n\nth = u*sinθ/g\n\nFrom the displacement equation we can find the maximum height:\n\nh = (u^2*sin^2θ)/(2*g)\n\nRange\nThe range of the motion is fixed by the condition y=0. Using this we can rearrange the parabolic motion equation to find the range of the motion:\n\nR = (u^2*sin2θ)/g\n\nSolving Problems\nIn projectile motion, an object moves in parabolic path; the path the object follows is called its trajectory.\n\nlearning objectives\n\nIdentify which components are essential in determining projectile motion of an object\nWe have previously discussed projectile motion and its key components and basic equations. Using that information, we can solve many problems involving projectile motion. Before we do this, let’s review some of the key factors that will go into this problem-solving.\n\nWhat is Projectile Motion?\nProjectile motion is when an object moves in a bilaterally symmetrical, parabolic path. The path that the object follows is called its trajectory. Projectile motion only occurs when there is one force applied at the beginning, after which the only influence on the trajectory is that of gravity.\n\nWhat are the Key Components of Projectile Motion?\nThe key components that we need to remember in order to solve projectile motion problems are:\n\nInitial launch angle, θ\nInitial velocity, u\nTime of flight, T\nAcceleration, a\nHorizontal velocity, vx\nVertical velocity, vy\nDisplacement, d\nMaximum height, H\nRange, R\n\nZero Launch Angle\nAn object launched horizontally at a height H travels a range v0*sqrt(2H/g) during a time of flight T = sqrt(2H/g).\n\nGeneral Launch Angle\nThe initial launch angle (0-90 degrees) of an object in projectile motion dictates the range, height, and time of flight of that object.\n\nThe range, maximum height, and time of flight can be found if you know the initial launch angle and velocity, using the following equations:\n\nR = (v^2*sin2θ)/g\nh = (v^2*sin^2θ)/(2*g)\nT = (2*v*sinθ)/g\n\nThe angle of reach is the angle the object must be launched at in order to achieve a specific distance:\n\nθ = 1/2 * sin^(-1)(g*d/v^2)\n\nKey Points\nObjects that are projected from, and land on the same horizontal surface will have a vertically symmetrical path.\nThe time it takes from an object to be projected and land is called the time of flight. This depends on the initial velocity of the projectile and the angle of projection.\nWhen the projectile reaches a vertical velocity of zero, this is the maximum height of the projectile and then gravity will take over and accelerate the object downward.\nThe horizontal displacement of the projectile is called the range of the projectile, and depends on the initial velocity of the object.\nIf an object is projected at the same initial speed, but two complementary angles of projection, the range of the projectile will be the same.",
  "tags": ["Two Dimensional Kinematics"],
  "difficulty": ["University Introductory / Advanced Placement C"]
}
]