{
    "topic": "Momentum",
        "title": "Understanding",
        "content": [
          "Newton’s second law expressed as a rate of change of momentum",
          "Impulse and force–time graphs",
          "Conservation of linear momentum",
          "Elastic collisions, inelastic collisions, and explosions",
           "The concept of momentum has arisen as a result of evidence from observations carried out over many centuries. The principle of conservation of momentum is an example of a law that has universal applicability. It allows the prediction of the outcomes of physical interactions at both the macroscopic and the microscopic level. Many areas of physics are informed by it, from the kinetic theory of gases to nuclear interactions.",
           "Applying conservation of momentum in simple isolated systems including (but not limited to) collisions, explosions, or water jets",
           "Using Newton’s second law quantitatively and qualitatively in cases where mass is not constant",
           "Sketching and interpreting force–time graphs",
           "Determining impulse in various contexts including (but not limited to) car safety and sports",
           "Qualitatively and quantitatively comparing situations involving elastic collisions, inelastic collisions, and explosions",
           "momentum: p = mv",
           "Newton's second law (momentum version): p / Δt = F",
           "kinetic energy: EK = p² / (2m)",
           "impulse: J = F Δt = Δp",
          "We call the product of the mass m of an object and its instantaneous velocity v the momentum p of the object (p = m × v) and this quantity turns out to have far-reaching importance in physics.",
          "First, here are some basics ideas about momentum.",
          "Momentum is mass × velocity never mass × speed.",
          "Momentum has direction. The mass is a scalar but velocity is a vector. When mass and velocity are multiplied together, the momentum is also a vector with the same direction as the velocity. Think of the mass as “scaling” the velocity – in other words, just making it bigger by a factor equal to the mass of the object.",
          "It follows that the unit of momentum is the product of the units of mass and velocity, in other words kg m s⁻¹. There is a shorter alternative to this that we shall see later.",
          "If velocity or mass is changing then the momentum must also be changing. We shall be looking at the two cases where one quantity changes while the other is held constant.",
          "When a net resultant force acts on an object, the object accelerates and the velocity must change. This means a change in momentum too. So a net force leads to a change in momentum.",
          "You may have seen a “Newton’s cradle”. Newton did not invent this device (it was developed in the twentieth century as an executive toy), but it helps us to visualize some important rules relating to his laws of motion, and it certainly seems appropriate to associate his name with it.",
          "One of the balls (the right-hand one in figure 2) is moved up and to the right, away from the remaining four. When released the ball falls back and hits the second ball from the right. The right-hand ball then stops moving and the left-most ball moves off to the left. It is as though the motion of the original ball transfers through the middle three – which remain stationary – and appears at the left-hand end.",
          "You can analyse this in terms of physics that you already know.",
          "The right-hand ball gains gravitational potential energy when it is raised. When it is released the potential energy is converted into kinetic energy as the ball gains speed. Eventually the ball strikes the next stationary one along, and a pair of action–reaction forces acts at the surfaces of the two balls (you might like to consider what they are). The stationary ball is compressed slightly by the force acting on it and this compression moves as a wave through the middle three balls. When the compression reaches the left-hand ball the elastic potential energy associated with the compression wave is converted into kinetic energy (because there is a net force on this sphere) and work begins to be done against the Earth’s gravity. The left-hand ball starts to move to the left. When the speed of the ball becomes zero, it is at its highest point on the left-hand side and the motion repeats in the reverse direction. The overall result is that the end spheres appear to perform an alternate series of half oscillations.",
          "Another way to view this sequence is as a transfer of momentum. Think about a simpler case where only two spheres are in contact (in the toy, three balls can be lifted out of the way). The right-hand sphere gains momentum as it falls from the top of its swing. When it collides with the other sphere, the momentum appears to be transferred to the second sphere. The first sphere now has zero momentum (it is stationary) and the second has gained momentum. What rules govern this transfer of momentum?",
          "These interactions between the balls in the Newton’s cradle are called collisions. This is the term given to any interaction where momentum transfers. Examples of collisions include firing a gun, hitting a ball with a bat in sport, two toy cars running into each other, and a pile driver sinking vertical cylinders into the ground on a construction site. There are many more.",
          "The exact details of this experiment will depend on the apparatus you have in your school.",
          "light gate timing card moving cart stationary cart raised to compensate for friction (see page 68)",
          "The experiment consists of measuring the speed of a cart of known mass and then launching it at another cart also of known mass that is initially stationary. Often there will be carts available to you of almost identical mass, as this is a particularly easy case to begin with.",
          "You will need a way to measure the velocity of the carts just before and just after the collision. This could be done in various ways:",
          "using a data logger with motion sensors",
          "using a paper tape system where a tape attached to the cart is pulled through a device that makes dots at regular time intervals on the tape",
          "using a video camera and computer software",
          "using a stop watch to measure the time taken to cover a short, known distance before and after the collision.",
          "If your carts run on a track, you can allow for the friction at the cart axles and the air resistance. This is done by raising the end of the track a little so that, when pushed, a cart runs at a constant speed. The friction at the bearings and the air resistance will be exactly compensated by the component of the cart weight down the track.",
          "For the first part of the experiment, begin by arranging that the two carts will stick together after colliding. This can be done in a number of ways, including using modelling clay, or a pin attached to one cart entering a piece of cork in the other, or two magnets (one on each cart) that attract.",
          "Make the first (moving) cart collide with and stick to the second (stationary) cart.",
          "Measure the speed of the first cart before the collision and the combined speed of the carts after the collision.",
          "Repeat the experiment a number of times and think carefully about the likely errors in the results.",
          "The initial momentum is mass of first cart × velocity of first cart. The final momentum is (mass of first cart + mass of second cart) × combined velocity of both carts.",
          "What can you say about the total momentum of the system before the collision compared with the total momentum after the collision? You should consider the experimental errors in the experiment before making your judgement.",
          "If you have done the experiment carefully, you should find that the momentum before and the momentum after the collision are approximately equal.",
          "Now extend your experiment to different cases: where the carts do not stick together, where they are both moving before the collision, where the masses are not the same, and so on.",
          "You may need to alter how you measure the velocity to cope with the different cases.",
          "If you carry out an experiment that compares the momentum before with the momentum after a collision then you should find (within the experimental uncertainty of your measurements) that the total momentum in the system does not change.",
          "An important point here is that there must be no force from outside the system acting on the objects taking part in the collision. As we saw earlier, external forces produce accelerations, and this changes the velocity and hence the momentum.",
          "You might argue that gravitational force is acting – and gravity certainly is acting on the carts in the experiment – but because the gravitational force is not being allowed to do any work, the force does not contribute to the interaction because the carts are not moving vertically.",
          "Momentum is always constant if no external force acts on the system. This is known as the principle of conservation of linear momentum, the word “linear” is here because this is momentum when the objects concerned are moving in straight lines. This conservation rule has never been observed to be broken, and is one of the important conservation rules that (as far as we know) are true throughout the universe. In nuclear physics, particles have been proposed in order to conserve momentum in cases where it was apparently not being conserved. These particles were subsequently found to exist.",
          "Momentum conservation is such an important rule that it is worth us considering a few different situations to see how momentum conservation works.",
          "In each of these cases we will assume that the centres of the objects lie on a straight line so that the collision happens in one dimension.",

          "This is known as an elastic collision and for it to happen no permanent deformation must occur in the colliding objects and no energy can be released as internal energy (through friction), sound, or any other way. The spheres in the Newton’s cradle lose only a little energy every time they collide and this is why this is a reasonable demonstration of momentum effects.",
          "The first object collides with the second stationary object. The first object stops and remains at rest while the second moves off at the speed that the first object had before the collision. (Try flicking a coin across a smooth table to hit an identical coin head-on.) In this case momentum is conserved because (using an obvious set of symbols for the mass m of the objects and their velocities u and v) m₁u = m₂v Because m₁ = m₂ then u = v so the velocity of one mass before the collision is equal to the velocity of the second mass afterwards. The kinetic energy of the moving mass (whichever mass is moving) is ½ mu² and it does not change either.",
          "This time (as you may have seen in an experiment or demonstration) the situation is more complicated.",
          "Again m₁u₁ + m₂u₂ = m₁v₁ + m₂v₂ but this time we cannot eliminate the mass terms so easily. What we do know, though, is that kinetic energy is conserved. So the kinetic energy before the collision must equal the kinetic energy after the collision (because no energy is lost).",
          "This means that (summing the kinetic energies before and after the collision) ½ m₁u₁² + ½ m₂u₂² = ½ m₁v₁² + ½ m₂v₂²",
          "The momentum and kinetic energy equations can be solved to show that v₁ = (m₁ – m₂)/(m₁ + m₂) u₁ + (2m₂)/(m₁ + m₂) u₂ and v₂ = (m₂ – m₁)/(m₁ + m₂) u₂ + (2m₁)/(m₁ + m₂) u₁",
          "(You will not be expected to prove these in, or memorize them for, an examination.)",
          "There are some interesting cases when mass m₂ is stationary and is struck by m₁:",
          "Case 1: m₁ is much smaller than m₂. Look at the v₁ equation. If m₁ ≪ m₂ then the first term becomes roughly (–m₂/m₂) u₁ which is u₁ ; the second term is zero because u₂ = 0. So the small mass “bounces” off the large mass, reversing its direction (shown by the minus sign). The large mass gains speed in the forward direction (the original direction of the small mass). The magnitude of the speed of the larger mass is roughly (2m₁/m₂) u₁ and this is a small fraction of the original speed of the small mass because (2m₁/m₂) is much smaller than 1.",
          "Case 2: m₁ is much greater than m₂. Here the original mass loses hardly any speed (though it must lose a little). The momentum lost by m₁ is given to m₂ which moves off in the same direction, but at about twice the original speed of m₁. Look at the v₁ and v₂ equations and satisfy yourself that this is true.",
           "When a moving object collides with a stationary one and the two objects stick together, then some of the initial kinetic energy is lost. After the collision, there is a single object with an increased (combined) mass and a single common velocity. This is known as an inelastic collision (figure 5).",
          "This is a case you may have studied experimentally in the Investigate!",
          "The momentum equation this time is m₁u₁ = (m₁ + m₂)v₁",
          "A rearrangement shows that v₁ = m₁u₁ / (m₁ + m₂) and, as we might expect, the final velocity is in the same direction as before but is always smaller than the initial velocity.",
          "As for energy loss, the incoming kinetic energy is ½ m₁u₁² and the final kinetic energy is ½ (m₁ + m₂)v₁² (substituting for v₁)",
          "This is ½ m₁²u₁² / (m₁ + m₂) which is ½ m₁²u₁² / (m₁ + m₂) = m₁ / (m₁ + m₂) × ½ m₁u₁².",
          "The ratio initial kinetic energy / final kinetic energy is (m₁ + m₂) / m₁",
          "There are many occasions when two initially stationary masses gain energy in some way. Some laboratory dynamics carts have a way to show this. An easy way is to attach two small strong magnets to the front of the carts so that when the carts are released after being held together with like poles of the magnets facing each other, the magnets repel and drive the carts apart.",
          "The analysis is quite straightforward in this case.",
          "The initial momentum is zero as neither object is moving.",
          "After the collision the momentum is m₁v₁ + m₂v₂ = 0.",
          "So m₁v₁ = –m₂v₂",
          "The objects move apart in opposite directions. If the masses are equal the speeds are the same, with one velocity the negative of the other. If the masses are not equal then –v₂ / v₁ = m₁ / m₂"

        
        ],
        "tags": ["Momentum"],
        "difficulty": ["High School Physics"]
        
    
  }