[
  {
    "title": "General Relativity Basics",
      "content": "Reference frames A reference frame allows us to refer to the position of a particle. Reference frames consist of an origin together with a set of axes. In this course we generally use the Cartesian reference frame, in which position is defined using three distances measured along axes that are at 90° to each other. The axes of a three-dimensional graph make up a Cartesian reference frame. Other frames are, of course, available. Sailors use latitude and longitude; these together with the distance of an object from the centre of the Earth constitute a different reference frame. Astronomers usually use angles when defining the position of a star that is being observed; they only need two angles because the distance to the star (for observational purposes) is irrelevant. For some of the frames of reference in use, one or more of Newton’s laws of motion do not hold. Our own frame on the surface of a rotating planet shows this straight away. Everything off-planet appears to be spinning around us. An object that is at rest relative to us on planet Earth is not moving at a constant velocity at all. This has consequences that we have already seen in earlier topics; the fictitious centrifugal force and the Coriolis force used to “explain” the movement of weather systems are two cases in point. For Newton’s first law to be valid we need to be careful about the nature of the reference frame in which we use the law. We define an inertial frame of reference as a frame in which an object obeys Newton’s first law: so that it travels at a constant velocity because no external force acts on it. Do inertial frames exist? The best way to find one is to take a spaceship out into deep space, well away from the gravitational effects of planets and stars, and then turn off the engines. No forces act from outside or inside the spacecraft and this will be a true inertial frame of reference. Galilean relativity and Newton’s postulates Even though we have to take some trouble to reach one, there are an infinite number of inertial frames of reference in the universe and there are a number of ways in which we can move between them. ● The first obvious way is to step sideways from one frame to another. This is known as a translation (figure 1(a)). ● The set of axes can be rotated to form another set. This is known as a rotation (figure 1(b)). We shall not consider these in detail in this course. ● One frame can move relative to another frame with a constant relative velocity. This is known as a boost. (figure 1(c)) It is easy to see that if an object moves with constant velocity in one reference frame then under any of these three conditions it will be measured as having a constant (but different) velocity in the other reference frame. The principle of relativity is often associated with Albert Einstein. In fact, Galileo was probably the first person to discuss the principle. He describes how, in a large sailing ship, butterflies in a cabin with no windows would be observed to fly at random whether the ship were moving at constant velocity or not. An observer in the cabin could not deduce by observing the butterflies whether the ship was moving. And the butterflies would certainly not be pinned against the back wall of the cabin. This principle of relativity as described by Galileo tells us about the nature of our universe. ● The translation rule is equivalent to saying that there is no special place in the universe; position is relative. ● The rotation rule says that there is no special direction; direction is relative. ● The boost rule says that there is no special velocity. Stationary is not an absolute condition and any object can be described as stationary with respect to another object. (As we shall see, the disagreement between Galileo’s ideas and those of Einstein is crucial here.) Thinking, for a translation, in terms only of the x-direction (that is, in one dimension), if the distance between the origins of two inertial frames S' and S’ is X then a position x in S is related to position x' in frame S' by x' = x - X For a boost, if one inertial frame moves relative to the other by a constant relative velocity v along the x-axis, then the distance between the origins of the reference frames must be changing by v every second and this distance is vt where t is the time since the frames coincided. Imagine that the origins of the two reference frames S and S' (Figure 1(c)) were at the same position (that is, they were coincident) at time t = 0. Technically, we say that clocks in the frames were adjusted so that x = x’ = 0 when t = t’ = 0. At a later time t, the origins of S and S' will be separated by vt where v is the velocity of frame S' relative to frame S. Therefore a position x in frame S will be related to position x’ in S' by x = x' + vt and x' = x - vt The velocities also transform in an obvious way. If the velocity in S is u and the velocity in S' is u', then u' = u - v This set of equations that link two reference frames by their relative velocity are known as the Galilean transformations. Newton developed Galileo’s ideas further in his Principa Mathematica by suggesting two important postulates (a postulate is an assertion or assumption that is not proved and acts as the starting point for a proof): ● Newton treated space and time as fixed and absolute. This is implied in our use of t in both equations above (t' does not appear, only t). A time interval between two events described in frame S is identical to the time interval between the same two events as described in frame S'. The evidence of our senses seems to confirm this (but remember that we do not travel close to the speed of light in everyday life). ● Newton recognized that two observers in separate inertial frames must make the same observations of the world. In other words, they will both arrive at the same physical laws that describe the universe. Nature of science The way Newton put it. These postulates were expressed somewhat differently by Newton in the Principa Mathematica – the book (in Latin) that he wrote to publish some of his discoveries. In translation his postulates were: “ I. Absolute, true, and mathematical time, of itself, and from its own nature, flows equably without relation to anything external . II. Absolute space, in its own nature, without any relation to anything external, remains always similar and immovable.” (Translation by Mottes (1971), revised by Cajorio, University of California Press.) A RELATIVITY Worked example 1 In a laboratory an electron travels at a speed of 2 × 104 m s–1 relative to the laboratory and another electron travels at 4 × 104 m s–1 relative to the laboratory. Use a Galilean transformation to calculate the speed of one electron in the frame of the other when they are travelling a) in opposite directions b) in the same direction. Solution a) The closing speed of the electrons is 2 × 104 – (– 4 × 104) = 6 × 104 m s–1 b) The relative speed of one electron relative to the other is 2 × 104 – (4 × 104) = 2 × 104 m s–1 TOK Changing perspectives In Topic 2 we began by describing Newton’s second law of motion in a simple way as: force = mass × acceleration Later we showed that this was better expressed as force = rate of change of momentum A similar change of expression is possible here: Newton’s first law is usually given as a variant of “Every object continues in its state of rest or uniform motion unless net external forces act on it” (and you should continue to use this or a similar wording in your own work). But this is not the only possibility. A succinct and interesting way to express Newton’s first law is as “Inertial frames exist”. To what extent do concise forms of scientific laws help or hinder our understanding? Charges and currents – a puzzle The choice of inertial frame can make a radical difference to the perception of a situation. Consider a positively-charged particle moving initially at velocity v some distance away from and parallel to a wire carrying a current. In the wire the electrons are also moving with speed v. The positive charges in the wire are stationary. We will use two inertial reference frames in this example. One frame is at rest relative to the positive charges in the wire. The other frame is at rest relative to the moving charge q. (a) (b) v v v +q + +q + v - - - - - - - - - - + + + + + + + + + + + v - - - - - - - - - - + + + + + + + + + + v v Figure 2 Moving charges in reference frames. To an observer at rest (figure 2(a)) with respect to the stationary positive charges the situation in the wire seems clear. The numbers of negative and positive charges in the wire are equal and therefore the lone moving charge +q does not experience an electrostatic (electric) force. The movement of the electrons in the wire to the right (a conventional current to the left) gives rise to circular magnetic field lines centred on the wire and going into the page above the wire. The single moving charge is therefore moving perpendicularly with respect to this field. Fleming’s left-hand rule indicates that there is a magnetic force acting perpendicularly outwards on the charge and therefore the charge will be accelerated in this direction. The stationary observer detects a magnetic repulsive force acting between the charge and the current-carrying wire.",
     "tags": ["Classical Mechanics and Reference Frames"],
    "difficulty": ["international baccalaureate"]
  },
  {
    "title": "Special Relativity Time Dilation",
      "content": "What is the situation from the point of view of the moving charge q? An observer moving with the charge (figure 2(b)) sees the single charge +q as stationary; electrons in the wire that also appear to be stationary, but the positive charges in the wire appear to be moving to the left at speed v. We could imagine that the moving positive charges lead to a magnetic field around the wire just as before – but this does not help! To the moving observer the charge +q is stationary relative to the resulting magnetic field and therefore no magnetic force should arise. What happens is that (as we shall see later) the relative movement of the positive charges in the wire leads to a contraction in the spacing of these charges as perceived by the observer moving with +q. There are more positive charges than negative charges per unit length as detected by the moving observer and so there is effectively a net repulsive force acting on +q (we shall see how this change arises from length contraction in a later sub-topic). Now the observer moving with q explains the force acting on q as electrostatic in origin, not magnetic as before. However, both observers report a force and in both cases the force acts outwards from the wire. The physical result is the same even though the explanations differ. A mathematical analysis from the standpoint of the two inertial frames also confirms that the magnitude of the force is identical in both cases. Another situation is that of two point electric charges moving in parallel directions at the same speed as each other. This case (figure 3) is not identical to that of the charge moving near a current-carrying wire. There is no balance of positive and negative charges to complicate matters this time. Again, we consider the situation from the standpoint of two separate inertial frames: that of an observer stationary relative to the point charges, and that of an observer moving at a different velocity relative to the charges. Observations made in the frame of the point charges are easier to understand (figure 3(a)): the observer moving with the charges sees two positive charges that repel and no magnetic attraction between the two. This observer describes the repulsion as purely electrostatic. v +q +q (a) stationary, observes a magnetic field due to both charges moving +q +q (b) Figure 3 Two point charges moving parallel. 511 A RELATIVITY TOK Validating a paradigm shift The development of Einstein’s relativity ideas required a shift in the view that scientists took of the physical rules that govern the universe. How do scientists ensure that the need to shift perspectives is valid? TOK Maxwell’s advances Einstein wrote: The precise formulation of the time–space laws was the work of Maxwell. Imagine his feelings when ...equations he had formulated proved to him that electromagnetic fields spread in the form of polarised waves, and at the speed of light!... it took physicists some decades to grasp the full significance of Maxwell's discovery, so bold was the leap that his genius forced upon the conceptions of his fellow workers. (Albert Einstein, Science, May 24, 1940) To what extent do you think this is true? 512 For an observer no longer stationary relative to the point charges (figure 3(b)), the situation is changed. From this point of view, the repulsive electric field is increased (through relativistic length contraction). There is also a magnetic field that was not apparent when the observer was stationary relative to the charges. This is because a moving charge gives rise to a magnetic field. Each charge now appears to be moving within the magnetic field due to the other charge and consequently there is an attraction that the observer describes as magnetic in origin. There is both an increased (electrostatic) repulsion and a new (magnetic) attraction compared with the stationary observer frame. Again, a mathematical analysis shows that the force between the charges is identical for all observer inertial frames of reference. This is what we expect given that all physical systems observed in inertial frames must obey the same laws. As Einstein himself said: “What led me ... to the special theory of relativity was the conviction that the electromagnetic force acting on a body in motion in a magnetic field was nothing else but an electric field.” Maxwell and electromagnetism In 1861 James Maxwell established the connection between electrostatics, electromagnetic induction, and the speed of light. He developed four equations that between them describe the whole of electrical and magnetic theory and lead to the recognition that light is a form of electromagnetic radiation. The four equations incorporate the value of the speed of light travelling in a vacuum (free space) in a fundamental way. The conclusion that must be drawn from Maxwell’s equations is that, if observers in different inertial frames make observations of the speed of light then, if they are to agree about physical laws, they must observe identical values for the speed of light. But the Galilean transformations predict a different result from this. The Galileo predicts that the speed of light differs in different frames by the magnitude of the relative velocity between the frames. So the inescapable conclusion that follows from Maxwell (same speed of light for all observers) is directly contrary to the assumption of absolute time and absolute space as postulated by Newton, and as embodied in the Galilean transformations. Physics had reached an impasse; it required the genius of Maxwell to recognize the problem. It required another genius, Einstein, to move the subject forward again half a century later. A. 2 LORENTZ TRANSFORMATIONS A.2 Lorentz transformations Understanding ➔ The two postulates of special relativity ➔ Clock synchronization ➔ The Lorentz transformations ➔ Velocity addition ➔ Invariant quantities (spacetime interval, proper time, proper length, and rest mass) ➔ Time dilation ➔ Length contraction ➔ The muon decay experiment Applications and skills ➔ Solving problems involving velocity addition ➔ Solving problems involving time dilation and length contraction ➔ Solving problems involving the muon decay experiment Nature of science Einstein’s theory of relativity stems from two postulates. He deduced the rest of the theory mathematically. This is an example of pure deductive science at work. Equations ➔ Lorentz transformation equations: 1 γ = ___ v 2 1- √_____ _ c 2 ➔ x' = γ (x - vt); ∆x' = γ (∆x - v∆t) ➔ t' = γ ( t - u-v ➔ u' = __ vx _ c 2 ) ; ∆t' = γ ( t - v∆x _ c 2 ) ➔ ∆t = γ∆ t 0 The two postulates of special relativity Newton’s two postulates of space and time from Sub-topic A.1 require an absolute time that is the same for all observers in inertial frames. This implies, through the Galilean transformation, that a moving observer will observe a different value for the speed of light in free space from that of a stationary observer.",
    "tags": ["Electromagnetism and the Speed of Light"],
    "difficulty": ["international baccalaureate"]
  }
]