[
    "The speed of light in a vacuum is approximately 299,792 kilometers per second.",
    "A day on Venus is longer than its year.",
    "Neutrons have no electric charge, unlike protons and electrons.",
    "Black holes can bend light due to their immense gravitational pull.",
    "The shortest war in history lasted 38 minutes.",
    "Electricity is the flow of electrons through a conductor",

"The unit of electric current is the ampere (A)",

"Ohm's Law states that voltage equals current times resistance (V = IR)",

"A circuit is a closed path that allows electric current to flow",

"Electric power is calculated by multiplying voltage and current (P = VI)",

"The electrical potential difference between two points is measured in volts (V)",

"Resistors are used in electrical circuits to limit the flow of current",

"Conductors, like copper, allow electricity to flow easily",

"Insulators, like rubber, resist the flow of electric current",

"The speed of electric current in a conductor is close to the speed of light",

"Albert Einstein developed the theory of relativity in the early 20th century",
"Special relativity states that the laws of physics are the same for all observers in uniform motion relative to one another",
"The speed of light in a vacuum is constant and always travels at approximately 299,792 kilometers per second",
"Time dilation occurs when an object approaches the speed of light, causing time to slow down for the object relative to a stationary observer",
"Mass and energy are interchangeable, as described by the famous equation E = mc²",
"General relativity describes how gravity is a curvature of spacetime caused by mass and energy",
"Black holes are regions of spacetime where gravity is so strong that not even light can escape",
"Gravitational time dilation means time runs slower near massive objects, like planets or stars",
"Relativity has been confirmed by experiments such as GPS satellite measurements, which account for time dilation effects",
"The theory of relativity revolutionized our understanding of space, time, and the universe"

  ]